Extensions/нп_КонтрольПроведенияПоДО/configurator/InformationRegisters/нп_РазрешенныеРеквизитыПриСогласованииДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>нп_РазрешенныеРеквизитыПриСогласованииДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ПолноеИмяОбъектаМетаданных</Name>
					<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>250</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
					<MinValue xsi:nil="true"/><MaxValue xsi:nil="true"/>					<FillChecking>ShowError</FillChecking><Master>false</Master>					<DenyIncompleteValues>true</DenyIncompleteValues>				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type><v8:Type>cfg:CatalogRef.Организации</v8:Type></Type>
					<MinValue xsi:nil="true"/><MaxValue xsi:nil="true"/>					<FillChecking>ShowError</FillChecking><Master>false</Master>					<DenyIncompleteValues>true</DenyIncompleteValues>				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type><v8:Type>xs:string</v8:Type><v8:StringQualifiers><v8:Length>250</v8:Length><v8:AllowedLength>Variable</v8:AllowedLength></v8:StringQualifiers></Type>
					<MinValue xsi:nil="true"/><MaxValue xsi:nil="true"/>					<FillChecking>ShowError</FillChecking><Master>false</Master>					<DenyIncompleteValues>true</DenyIncompleteValues>				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/нп_КонтрольПроведенияПоДО/configurator/CommonModules/нп_КонтрольПроведенияПоСогласованиюДОПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает настройку контроля по типу документа и организации (кэш на время сеанса).
//
// Параметры:
//  ПолноеИмя - Строка - полное имя объекта метаданных.
//  Организация - СправочникСсылка.Организации - организация.
//
// Возвращаемое значение:
//  Структура, Неопределено
//
Функция НастройкаКонтроля(ПолноеИмя, Организация) Экспорт
	
	Если Не ЗначениеЗаполнено(ПолноеИмя) Или Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Настройки.ПолноеИмяОбъектаМетаданных КАК ПолноеИмяОбъектаМетаданных,
		|	Настройки.Организация КАК Организация,
		|	Настройки.КонтролироватьПроведение КАК КонтролироватьПроведение,
		|	Настройки.ДатаНачалаДействия КАК ДатаНачалаДействия
		|ИЗ
		|	РегистрСведений.нп_НастройкиКонтроляПроведенияПоДО КАК Настройки
		|ГДЕ
		|	Настройки.ПолноеИмяОбъектаМетаданных = &ПолноеИмя
		|	И Настройки.Организация = &Организация");
	Запрос.УстановитьПараметр("ПолноеИмя", ПолноеИмя);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ПолноеИмяОбъектаМетаданных", Выборка.ПолноеИмяОбъектаМетаданных);
	Результат.Вставить("Организация", Выборка.Организация);
	Результат.Вставить("КонтролироватьПроведение", Выборка.КонтролироватьПроведение);
	Результат.Вставить("ДатаНачалаДействия", Выборка.ДатаНачалаДействия);
	
	Возврат Результат;
	
КонецФункции

// Возвращает соответствие разрешённых имён реквизитов (ключ = имя или ТЧ.Реквизит).
//
Функция РазрешенныеРеквизиты(ПолноеИмя, Организация) Экспорт
	
	Результат = Новый Соответствие;
	
	Если Не ЗначениеЗаполнено(ПолноеИмя) Или Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Результат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Разрешенные.ИмяРеквизита КАК ИмяРеквизита
		|ИЗ
		|	РегистрСведений.нп_РазрешенныеРеквизитыПриСогласованииДО КАК Разрешенные
		|ГДЕ
		|	Разрешенные.ПолноеИмяОбъектаМетаданных = &ПолноеИмя
		|	И Разрешенные.Организация = &Организация");
	Запрос.УстановитьПараметр("ПолноеИмя", ПолноеИмя);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ИмяРеквизита, Истина);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

// Признак: для типа документа есть хотя бы одна запись настроек контроля (кэш сеанса).
//
Функция ТипДокументаУчаствуетВКонтроле(ПолноеИмя) Экспорт
	
	Если Не ЗначениеЗаполнено(ПолноеИмя) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЕстьНастройка
		|ИЗ
		|	РегистрСведений.нп_НастройкиКонтроляПроведенияПоДО КАК Настройки
		|ГДЕ
		|	Настройки.ПолноеИмяОбъектаМетаданных = &ПолноеИмя
		|	И Настройки.КонтролироватьПроведение");
	Запрос.УстановитьПараметр("ПолноеИмя", ПолноеИмя);
	
	Результат = Не Запрос.Выполнить().Пустой();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
